Repository: mohammadr3z/storage-for-edd-via-s3-compatible
Catalog: languages/storage-for-edd-via-s3-compatible-*.po
Languages: fa_ir

source: -- Select Bucket --
fa_ir: -- انتخاب باکت --

source: -- No buckets found --
fa_ir: -- باکتی یافت نشد --

source: -- Error loading buckets --
fa_ir: -- خطا در بارگذاری باکت‌ها --

source: -- Save credentials first to load buckets --
fa_ir: -- ابتدا اعتبارنامه‌ها را ذخیره کنید تا باکت‌ها بارگذاری شوند --

source: S3 Storage Settings
fa_ir: تنظیمات فضای ذخیره‌سازی S3

source: Access Key
fa_ir: کلید دسترسی

source: Enter your S3 Access Key
fa_ir: کلید دسترسی S3 خود را وارد کنید

source: Secret Key
fa_ir: کلید خصوصی

source: Enter your S3 Secret Key
fa_ir: کلید خصوصی S3 خود را وارد کنید

source: Endpoint URL
fa_ir: آدرس اینترنتی

source: Enter your S3 compatible endpoint URL (e.g. https://s3.example.com)
fa_ir: آدرس اینترنتی سازگار با S3 خود را وارد کنید (مثلا https://s3.example.com)

source: Bucket Name
fa_ir: نام باکت

source: Select your S3 bucket
fa_ir: باکت S3 خود را انتخاب کنید

source: Please save your S3 credentials first to enable bucket selection
fa_ir: لطفا ابتدا اعتبارنامه‌های S3 خود را ذخیره کنید تا انتخاب باکت فعال شود

source: Download Link Expiry (minutes)
fa_ir: انقضای لینک دانلود (دقیقه)

source: How many minutes should the download link be valid?
fa_ir: لینک دانلود برای چند دقیقه معتبر باشد؟

source: S3 Storage
fa_ir: فضای ذخیره‌سازی S3

source: Storage for EDD via S3-Compatible:
fa_ir: ذخیره‌سازی برای EDD از طریق S3-Compatible:

source: Access Key and Secret Key are required for S3 storage to work properly.
fa_ir: کلید دسترسی و کلید خصوصی برای عملکرد صحیح فضای ذخیره‌سازی S3 ضروری است.

source: Configure S3 Settings
fa_ir: پیکربندی تنظیمات S3

source: Upload to S3
fa_ir: آپلود در S3

source: S3 Library
fa_ir: کتابخانه S3

source: Security check failed.
fa_ir: بررسی امنیتی ناموفق بود.

source: S3 File Browser
fa_ir: مرور فایل های S3

source: No S3 bucket selected
fa_ir: باکت S3 انتخاب نشده است

source: Please configure your S3 settings and select a bucket before browsing files.
fa_ir: لطفا تنظیمات S3 خود را پیکربندی کرده و قبل از مرور فایل‌ها، یک باکت انتخاب کنید.

source: You need to configure Access Key, Secret Key, Endpoint, and select a bucket to browse S3 files.
fa_ir: برای مرور فایل‌های S3 باید کلید دسترسی، کلید مخفی، نقطه پایانی را پیکربندی کرده و یک باکت انتخاب کنید.

source: Select a file from S3
fa_ir: فایلی را از S3 انتخاب کنید

source: Connection Error
fa_ir: خطای اتصال

source: Unable to connect to your S3 storage.
fa_ir: امکان اتصال به فضای ذخیره‌سازی S3 شما وجود ندارد.

source: Error details:
fa_ir: جزئیات خطا:

source: Check S3 Settings
fa_ir: بررسی تنظیمات S3

source: Browsing: %s
fa_ir: در حال مرور: %s

source: Browsing bucket: %s
fa_ir: در حال مرور باکت: %s

source: File Name
fa_ir: نام فایل

source: File Size
fa_ir: حجم فایل

source: Last Modified
fa_ir: آخرین اصلاح

source: Actions
fa_ir: عملیات

source: Unknown
fa_ir: نامشخص

source: Select File
fa_ir: انتخاب فایل

source: No files found
fa_ir: فایلی یافت نشد

source: No files found in the path: %s
fa_ir: هیچ فایلی در مسیر یافت نشد: %s

source: No files found in bucket: %s
fa_ir: فایلی در باکت یافت نشد: %s

source: Possible reasons:
fa_ir: دلایل احتمالی:

source: The bucket or path is empty
fa_ir: باکت یا مسیر خالی است

source: Your S3 credentials lack proper read permissions
fa_ir: اعتبارنامه‌های S3 شما فاقد مجوزهای خواندن مناسب هستند

source: The bucket name or endpoint URL is incorrect
fa_ir: نام باکت یا نشانی اینترنتی نقطه پایانی نادرست است

source: Uploading to directory: %s
fa_ir: آپلود به دایرکتوری: %s

source: Uploading to bucket: %s
fa_ir: آپلود در باکت: %s

source: Error
fa_ir: خطا

source: Upload Successful
fa_ir: آپلود با موفقیت انجام شد

source: File %s uploaded successfully!
fa_ir: فایل %s با موفقیت اپلود شد!

source: Use this file in your Download
fa_ir: از این فایل در دانلودهای خود استفاده کنید

source: Maximum upload file size: %s
fa_ir: حداکثر حجم فایل برای آپلود: %s

source: File selected successfully!
fa_ir: فایل با موفقیت انتخاب شد!

source: Error selecting file. Please try again.
fa_ir: خطا در انتخاب فایل. لطفاً دوباره تلاش کنید.

source: File size too large. Maximum allowed size is
fa_ir: حجم فایل خیلی بزرگ است. حداکثر اندازه مجاز

source: You do not have permission to upload files to S3.
fa_ir: شما اجازه آپلود فایل‌ها در S3 را ندارید.

source: No file selected for upload.
fa_ir: فایلی برای آپلود انتخاب نشده است.

source: S3 configuration is incomplete.
fa_ir: پیکربندی S3 ناقص است.

source: Unable to read uploaded file.
fa_ir: قادر به خواندن فایل آپلود شده نیست.

source: Invalid file upload.
fa_ir: آپلود فایل نامعتبر است.

source: An error occurred while attempting to upload your file.
fa_ir: هنگام تلاش برای آپلود فایل شما خطایی رخ داد.

source: Please select a file to upload.
fa_ir: لطفا فایلی را برای آپلود انتخاب کنید.

source: File size too large. Maximum allowed size is %s
fa_ir: حجم فایل بیش از حد بزرگ است. حداکثر حجم مجاز %s است

source: Storage for EDD via S3-Compatible
fa_ir: فضای ذخیره‌سازی سازگار با S3 برای EDD

source: Enable secure cloud storage and delivery of your digital products through S3-compatible services for Easy Digital Downloads.
fa_ir: فعال‌سازی ذخیره‌سازی ابری امن و تحویل محصولات دیجیتال شما از طریق سرویس‌های سازگار با S3 برای Easy Digital Downloads.
